# Курс: AI+Python
# Модуль 2. Computer Vision
# Тема: YOLO: Object Segmentation
# Частина 8
# Завдання 1
# Відкрийте відео data/lesson_pose/sitting.mp4
# Отримайте перший кадр
# Покажіть його, за потреби змініть розмір

import cv2
import ultralytics

cap = cv2.VideoCapture(r'data/lesson_pose/sitting.mp4')
success, img = cap.read()

# cv2.imshow("img", img)

# Завдання 2
# Застосуйте модель YOLO Pose
# Отримайте результати (result) та виведіть їх на екран9
# Використайте параметри device

model = ultralytics.YOLO("yolo11s-pose.pt")

results = model.predict(
    img,
    device="cuda"
)
result = results[0]  #  дістаємо один результат зі списку

# print(result)

# Завдання 3
# Користуючись методом plot() отримайте зображення з
# рамками та підписами і покажіть його.

result_img = result.plot()
cv2.imshow("result", result_img)

# Завдання 4
# ● Отримайте інформацію про ключові точки(keypoints)
# ● Виведіть її на екран
# ● Отримайте координати точок(xy)
# ● Виведіть координати на екран разом з типом даних та
# розміром(позбудьтесь тензорів за допомогою cpu() та numpy())

keypoints = result.keypoints
print(keypoints)

xy = keypoints.xy
xy = xy.cpu().numpy()

print(xy)
print(xy.shape)
print(xy.dtype)

# Завдання 5
# ● Отримайте координати для лівого коліна, лівої руки, правої руки для першого об’єкта
# ● Намалюйте ці точки на зображенні:
# ○ ліве коліно – зелений
# ○ ліва рука – червоний
# ○ права рука – білий

xy = xy[0]
xy = xy.astype(int)

x_left_knee, y_left_knee = xy[14]
x_left_hand, y_left_hand = xy[10]
x_right_hand, y_right_hand = xy[9]
x_right_knee, y_right_knee = xy[13]

# намалювати коло на зображенні лівого коліна
cv2.circle(
    img,   # зображення де малювати коло
    center=(x_left_knee, y_left_knee),   # координати центру
    radius=15,   # радіус в пікселях
    color=(0, 255, 0),  # колір в BGR(синій)
    thickness=-1,   # товщина ліній, -1 означає повністю заповнити кольором
)

print(x_left_knee, y_left_knee, x_left_hand, y_left_hand)

# намалювати коло на зображенні лівої руки
cv2.circle(
    img,   # зображення де малювати коло
    center=(x_left_hand, y_left_hand),   # координати центру
    radius=15,   # радіус в пікселях
    color=(0, 0, 255),  # колір в BGR(синій)
    thickness=-1,   # товщина ліній, -1 означає повністю заповнити кольором
)

# намалювати коло на зображенні правої руки
cv2.circle(
    img,   # зображення де малювати коло
    center=(x_right_hand, y_right_hand),   # координати центру
    radius=15,   # радіус в пікселях
    color=(255, 255, 255),  # колір в BGR(синій)
    thickness=-1,   # товщина ліній, -1 означає повністю заповнити кольором
)
#cv2.imshow('image', img)

# Завдання 6
# Для кожного кадру на відео намалюйте координати для
# лівого коліна, лівої руки, правої руки
# Беріть координати для першого об’єкта
# Завдання 7
# Під час відео обраховуйте кількість присідань.
# Вважайте що людина присіла якщо рука опустилась нижче коліна.
# Кількість присідань відображайте на кадрі(cv2.putText)
# Завдання 8
# Модифікуйте код, щоб кількість присідань виводилась правильно.
# Для цього вам потрібно визначати чи людина зараз присідає, чи піднімається за правилом:
# ● якщо рука нижче коліна, то людина встає
# ● якщо рука вище коліна – присідає
# Рахуйте лише ті присідання які відбулись коли людина
# присідає та рука опинилась нижче коліна.
# Разом з кількістю присідань відображайте чи людина присідає, чи встає
total_sitting = 0
is_sitting = True

while True:
    success,frame = cap.read()

    if not success:
        break
    results = model.predict(
        frame,
        device="cuda"
    )
    result = results[0]

    keypoints = result.keypoints

    result = result.plot()


    xy = keypoints.xy
    xy = xy.cpu().numpy()

    xy = xy[0]
    xy = xy.astype(int)

    x_left_knee, y_left_knee = xy[14]
    x_left_hand, y_left_hand = xy[10]
    x_right_hand, y_right_hand = xy[9]
    x_right_knee, y_right_knee = xy[13]

    cv2.circle(
        frame,  # зображення малювати коло на лівому коліні
        center=(x_left_knee, y_left_knee),  # координати центру
        radius=15,  # радіус в пікселях
        color=(0, 255, 0),  # колір в BGR (ліве коліно – зелений)
        thickness=-1,  # товщина ліній, -1 означає повністю заповнити кольором
    )

   # намалювати коло на лівій руці
    cv2.circle(
        frame,  # зображення де малювати коло на лівій руці
        center=(x_left_hand, y_left_hand),  # координати центру
        radius=15,  # радіус в пікселях
        color=(255, 255, 255),  # колір в BGR (ліва рука – червоний)
        thickness=-1,  # товщина ліній, -1 означає повністю заповнити кольором
    )
    # намалювати коло на правій руці
    cv2.circle(
        frame,  # зображення де малювати коло на правій руці
        center=(x_right_hand, y_right_hand),  # координати центру
        radius=15,  # радіус в пікселях
        color=(0, 0, 255),  # колір в BGR (права рука – білий)
        thickness=-1,  # товщина ліній, -1 означає повністю заповнити кольором
    )

    cv2.circle(
        frame,  # зображення де малювати коло на правій руці
        center=(x_right_knee, y_right_knee),  # координати центру
        radius=15,  # радіус в пікселях
        color=(255, 0, 0),  # колір в BGR (праве коліно – синій)
        thickness=-1,  # товщина ліній, -1 означає повністю заповнити кольором
    )

    # Коли дівчина сідає, рука опускається НИЖЧЕ коліна (її y-руки стає більшим за y-коліна)
    if y_right_hand > y_right_knee:
        if not is_sitting:
            total_sitting += 1
            is_sitting = True
    else:
        # Коли вона встає, рука піднімається ВИЩЕ коліна (її y-руки стає меншим)
        if y_right_hand < (y_right_knee - 30):  # -30 пікселів захищають від випадкового сіпання
            is_sitting = False

        # накласти текст на зображення
    cv2.putText(
        frame,  # зображення де пишемо текст
        f"Total_sitting: {total_sitting}, Is_sitting: {is_sitting}",  # текст
        (40, 40),  # позиція, лівий нижній кут
        cv2.FONT_HERSHEY_SIMPLEX,  # шрифт
        1,  # розмір шрифту
        (255, 255, 255),  # колір в BGR
        2  # товщина ліній
    )

    cv2.imshow('image', frame)
    if cv2.waitKey(1) & 0xFF == ord('q'):
        break


# Завдання 9
# ● Отримайте 258 кадр з відео
# ● Застосуйте модель
# ● Отримайте результати(result)
# ● Отримайте дані про рамки(boxes)
# ● Отримайте дані про рамку для першого об’єкта та виведіть їх
# ● Відобразіть результати(метод plot())
# ● Зробіть висновки


# Завдання 10
# Створіть функцію get_box_area(box)
# Параметри:
# ● box – інформація про рамку об’єкта
# Функція повинна
# ● отримати дані про рамки у форматі xywh
# ● позбудьтесь тензорів
# ● отримайте ширину(w) та висоту(h) рамки
# ● поверніть площу рамки
# За допомогою функцій get_box_area покажіть площі
# рамок для кожного об’єкта на 200 кадрі

# Завдання 11
# Створіть функцію get_largets_box_id(boxes)
# Параметри:
# ● boxes – інформація про рамки всіх об’єктів
# Функція повинна індекс рамки з найбільшою площею.
# Скористайтесь функцією get_box_area

# Завдання 12
# Модифікуйте завдання 8 так щоб вибиралися точки
# об’єкта з найбільшою рамкою.
# Скористайтесь get_largets_box_id(boxes)

# Завдання 13
# Відкрийте відео data/lesson_pose/hopak.mp4
# Покажіть відео добавляючи на кожен кадр назву руху

cv2.waitKey(0)
cv2.destroyAllWindows()