# Курс: AI+Python
# Модуль 3. Generative AI, LLM
# Тема: Langchain. Частина 2
# Завдання 1
# Напишіть промпт для генерації коду функції для
# вирішення певної задачі.
# Вхідні параметри – мова програмування, опис задачі
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot
import os
import dotenv
import langchain
from langchain_google_genai import GoogleGenerativeAI
import langchain_google_genai
from langchain_core.prompts import PromptTemplate

from lesson2 import response

# завантаження даних з файлу .env
dotenv.load_dotenv()

# сам api key
api_key = os.getenv('GEMINI_API_KEY')

llm = GoogleGenerativeAI(
    model='gemini-3.5-flash-lite',   # назва моделі
    api_key=api_key,
    temperature=0.5
)
prompt = PromptTemplate.from_template ("""
    Ти - асистент програміст
    Задача: згенерувати код на {prog_lang} для вирішення задачі
    
    ###ПРАВИЛА###
    1. Пиши тільки код
    2. Пиши простий код з посиланнями для початківця
    3. Розпиши максимально детально з поясненням кожного рядка коду
    
    ###ПРИКЛАДИ###
    
    ###ОПИС ЗАДАЧІ###
    {customer_task}
""")

prog_lang = "python"
customer_task = "simple calculator, +/-"

data = {
    "prog_lang": "python",
    "customer_task": customer_task,
}
text = prompt.invoke(data)

response = llm.invoke(text)
print(response)

# Завдання 2
# Напишіть промпт для переведення тексту з
# неформального стилю в формальний
# Вхідні параметри – текст
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot

print("\nВИКОНАННЯ ЗАВДАННЯ ПО 2-м різним моделям")
print("\nРеалізація Zero-shot")
# --- Реалізація Zero-shot ---
prompt_zero_shot = PromptTemplate.from_template("""
Ти - редактор тексту.
Задача: переводити тексти з неформального стилю в формальний.

###ВИМОГИ###
1. Повинен бути збережений основний зміст з оригінального тексту.
2. Відповідь не перевищує 3-4 речень.
3. Виправ всі граматичні, орфографічні помилки та знаки пунктуації.

###ПАРАМЕТРИ###
Текст: {text}

Формальний варіант:
""")

input_text = "Надрукуй мені шпаргалку по всім основам вивчення Пайтону і все, що зним"

# Передаємо дані у промпт
text_zero_shot = prompt_zero_shot.invoke({"text": input_text})
response_zero_shot = llm.invoke(text_zero_shot)
print("--- Результат Zero-shot ---")
print(response_zero_shot)


# --- Реалізація Few-shot ---
prompt_few_shot = PromptTemplate.from_template("""
Ти - редактор тексту.
Задача: переводити тексти з неформального стилю в формальний.

###ВИМОГИ###
1. Повинен бути збережений основний зміст з оригінального тексту.
2. Відповідь не перевищує 3-4 речень.
3. Виправ всі граматичні, орфографічні помилки та знаки пунктуації.

###ПРИКЛАДИ###
Приклад 1:
Неформальний текст: "Привіт! Слухай, я кароч не встигаю з відчотом, скину завтра зранку, сорян."
Формальний варіант: "Вітаю. Повідомляю, що з технічних причин я не встигаю підготувати звіт сьогодні. 
Проєкт буде надісланий завтра вранці. Перепрошую за незручності."

Приклад 2:
Неформальний текст: "Та коди ці ваші повна діч, нічо не паше, хелпаніть розібратись пліз."
Формальний варіант: "У мене виникли труднощі з налаштуванням програмного коду, через що програма наразі не працює. 
Буду вдячний за допомогу у вирішенні цієї проблеми."

###ПАРАМЕТРИ###
Текст: {text}

Формальний варіант:
""")

input_text = "Надрукуй мені шпаргалку по всім основам вивчення Пайтону і все, що зним"

# Передаємо дані у промпт
text_few_shot = prompt_few_shot.invoke({"text": input_text})
response_few_shot = llm.invoke(text_few_shot)
print("\n--- Результат Few-shot ---")
print(response_few_shot)



# Завдання 3
# Прочитайте файл data\lesson10\products.txt з описом
# Практичне завдання
# послуг СПА. Напишіть промпт для рекомендації послуги
# виходячи з запиту користувача
# Вхідні параметри – опис товарів, запит користувача
# Реалізуйте двома способами:
#  Zero-shot
#  Chain of Thoughts

with open ("data/lesson10/products.txt", "r", encoding="utf-8") as file:
    products = file.read()

prompt = PromptTemplate.from_template("""
    Ти - менеджер СПА.
    Твоє завдання полягає в наданні рекомендаційних послуг на основі запиту клієнта
    
    ###ОПИС СПА ПРОЦЕДУР###
    {products}
    
    ###КРОКИ РІШЕННЯ###
    1. Розбери запит клієнта та визнач необхідну інформацію пов'язану з частинами тіла, ціною тривалістю.
    2. Подивись в описі СПА процедур, всі можливі процедури для клієнта
    3. В черговий раз перевір найкращій варіант для клієнта
    
    ###ВХІДНІ ДАНІ###
    ЗАПИТ КОРИСТУВАЧА: {user_query}
""")

data = {
    "products": products,
    "user_query": "Чи є у Вас масаж для спини до 1300 грн"
}
text = prompt.invoke(data)
response = llm.invoke(text)

print(response)